# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

In [1]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv')
df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN

In [2]:
df_filter = df[(df['Total Claim Amount'] > 1000) & (df['Response'] == 'Yes')]

In [3]:
df_filter.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
189,189,OK31456,California,11009.130490,Yes,Premium,Bachelor,1/24/11,Employed,F,...,0.0,1,Corporate Auto,Corporate L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,NaN
236,236,YJ16163,Oregon,11009.130490,Yes,Premium,Bachelor,1/24/11,Employed,F,...,0.0,1,Special Auto,Special L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,A
419,419,GW43195,Oregon,25807.063000,Yes,Extended,College,2/13/11,Employed,F,...,1.0,2,Personal Auto,Personal L2,Offer1,Branch,1027.200000,Luxury Car,Small,A
442,442,IP94270,Arizona,13736.132500,Yes,Premium,Master,2/13/11,Disabled,F,...,0.0,8,Personal Auto,Personal L2,Offer1,Web,1261.319869,SUV,Medsize,A
587,587,FJ28407,California,5619.689084,Yes,Premium,High School or Below,1/26/11,Unemployed,M,...,0.0,1,Personal Auto,Personal L1,Offer2,Web,1027.000029,SUV,Medsize,A

2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

In [49]:
df_marketing_yes = df[df['Response'] == 'Yes']

In [50]:
df_marketing_yes.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type,Month
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
8,8,FM55990,California,5989.773931,Yes,Premium,College,2011-01-19,Employed,M,...,1,Personal Auto,Personal L1,Offer2,Branch,739.200000,Sports Car,Medsize,NaN,1
15,15,CW49887,California,4626.801093,Yes,Basic,Master,2011-01-16,Employed,F,...,1,Special Auto,Special L1,Offer2,Branch,547.200000,SUV,Medsize,NaN,1
19,19,NJ54277,California,3746.751625,Yes,Extended,College,2011-02-26,Employed,F,...,1,Personal Auto,Personal L2,Offer2,Call Center,19.575683,Two-Door Car,Large,A,2
27,27,MQ68407,Oregon,4376.363592,Yes,Premium,Bachelor,2011-02-28,Employed,F,...,1,Personal Auto,Personal L3,Offer2,Agent,60.036683,Four-Door Car,Medsize,NaN,2

In [51]:
df_marketing_yes = df_marketing_yes.groupby(['Policy Type', 'Gender'])['Total Claim Amount'].agg('mean').reset_index()

In [52]:
df_marketing_yes

      Policy Type Gender  Total Claim Amount
0  Corporate Auto      F          433.738499
1  Corporate Auto      M          408.582459
2   Personal Auto      F          452.965929
3   Personal Auto      M          457.010178
4    Special Auto      F          453.280164
5    Special Auto      M          429.527942

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [8]:
df_num_customer_by_state = df.groupby('State').size().reset_index(name = 'num_customers')

In [9]:
df_num_customer_by_state

        State  num_customers
0     Arizona           1937
1  California           3552
2      Nevada            993
3      Oregon           2909
4  Washington            888

In [10]:
df_more_500_cst = df_num_customer_by_state[df_num_customer_by_state['num_customers'] > 500]

In [11]:
df_more_500_cst

        State  num_customers
0     Arizona           1937
1  California           3552
2      Nevada            993
3      Oregon           2909
4  Washington            888

All states have more than 500 customers have policies in each state.

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [53]:
df_clv = df.groupby(['Education', 'Gender'])['Customer Lifetime Value'].agg(['median', 'min', 'max']).reset_index()

In [54]:
df_clv

              Education Gender       median          min          max
0              Bachelor      F  5640.505303  1904.000852  73225.95652
1              Bachelor      M  5548.031892  1898.007675  67907.27050
2               College      F  5623.611187  1898.683686  61850.18803
3               College      M  6005.847375  1918.119700  61134.68307
4                Doctor      F  5332.462694  2395.570000  44856.11397
5                Doctor      M  5577.669457  2267.604038  32677.34284
6  High School or Below      F  6039.553187  2144.921535  55277.44589
7  High School or Below      M  6286.731006  1940.981221  83325.38119
8                Master      F  5729.855012  2417.777032  51016.06704
9                Master      M  5579.099207  2272.307310  50568.25912

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

In [14]:
df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 26 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Unnamed: 0                     10910 non-null  int64
 1   Customer                       10910 non-null  object
 2   State                          10279 non-null  object
 3   Customer Lifetime Value        10910 non-null  float64
 4   Response                       10279 non-null  object
 5   Coverage                       10910 non-null  object
 6   Education                      10910 non-null  object
 7   Effective To Date              10910 non-null  object
 8   EmploymentStatus               10910 non-null  object
 9   Gender                         10910 non-null  object
 10  Income                         10910 non-null  int64
 11  Location Code                  10910 non-null  object
 12  Marital Status                 10910 non-null  object
 13  Monthly Premium Auto           10910 non-null  int64
 14  Months Since Last Claim        10277 non-null  float64
 15  Months Since Policy Inception  10910 non-null  int64
 16  Number of Open Complaints      10277 non-null  float64
 17  Number of Policies             10910 non-null  int64
 18  Policy Type                    10910 non-null  object
 19  Policy                         10910 non-null  object
 20  Renew Offer Type               10910 non-null  object
 21  Sales Channel                  10910 non-null  object
 22  Total Claim Amount             10910 non-null  float64
 23  Vehicle Class                  10288 non-null  object
 24  Vehicle Size                   10288 non-null  object
 25  Vehicle Type                   5428 non-null   object
dtypes: float64(4), int64(5), object(17)
memory usage: 2.2+ MB

In [17]:
df['Effective To Date'] = pd.to_datetime(df['Effective To Date'], format='%m/%d/%y')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 26 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Unnamed: 0                     10910 non-null  int64
 1   Customer                       10910 non-null  object
 2   State                          10279 non-null  object
 3   Customer Lifetime Value        10910 non-null  float64
 4   Response                       10279 non-null  object
 5   Coverage                       10910 non-null  object
 6   Education                      10910 non-null  object
 7   Effective To Date              10910 non-null  datetime64[ns]
 8   EmploymentStatus               10910 non-null  object
 9   Gender                         10910 non-null  object
 10  Income                         10910 non-null  int64
 11  Location Code                  10910 non-null  object
 12  Marital Status                 10910 non-null  object
 13  Monthly Premium Auto           10910 non-null  int64
 14  Months Since Last Claim        10277 non-null  float64
 15  Months Since Policy Inception  10910 non-null  int64
 16  Number of Open Complaints      10277 non-null  float64
 17  Number of Policies             10910 non-null  int64
 18  Policy Type                    10910 non-null  object
 19  Policy                         10910 non-null  object
 20  Renew Offer Type               10910 non-null  object
 21  Sales Channel                  10910 non-null  object
 22  Total Claim Amount             10910 non-null  float64
 23  Vehicle Class                  10288 non-null  object
 24  Vehicle Size                   10288 non-null  object
 25  Vehicle Type                   5428 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(5), object(16)
memory usage: 2.2+ MB

In [19]:
df['Month'] = df['Effective To Date'].dt.month

In [20]:
df_policies_state_month = df.groupby(['State', 'Month']).size().reset_index(name='Num Policies')

In [21]:
df_policies_state_month

        State  Month  Num Policies
0     Arizona      1          1008
1     Arizona      2           929
2  California      1          1918
3  California      2          1634
4      Nevada      1           551
5      Nevada      2           442
6      Oregon      1          1565
7      Oregon      2          1344
8  Washington      1           463
9  Washington      2           425

In [22]:
df_pivot_table = df_policies_state_month.pivot(index='State', columns='Month', values='Num Policies').fillna(0)

In [23]:
df_pivot_table

Month          1     2
State
Arizona     1008   929
California  1918  1634
Nevada       551   442
Oregon      1565  1344
Washington   463   425

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

In [56]:
df_policies_state_month_2 = df.groupby(['State', 'Month'])['Policy'].count().reset_index(name='Num Policies')

In [58]:
df_total_policies_by_state = df_policies_state_month_2.groupby('State')['Num Policies'].sum().reset_index()

In [59]:
df_top = df_total_policies_by_state.sort_values(by='Num Policies', ascending=False).head(3)

In [60]:
df_top

        State  Num Policies
1  California          3552
3      Oregon          2909
0     Arizona          1937

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [67]:
df_melted = df[['Response', 'Sales Channel']]

In [68]:
df_melted

      Response Sales Channel
0           No         Agent
1           No   Call Center
2           No   Call Center
3          Yes        Branch
4           No        Branch
...        ...           ...
10905       No           Web
10906       No        Branch
10907       No           Web
10908       No        Branch
10909      NaN           Web

[10910 rows x 2 columns]

In [69]:
df_melted = pd.melt(df_melted, id_vars=['Response'], value_vars=['Sales Channel'],
                    var_name='Marketing Channel', value_name='Channel Used')

In [70]:
df_melted

      Response Marketing Channel Channel Used
0           No     Sales Channel        Agent
1           No     Sales Channel  Call Center
2           No     Sales Channel  Call Center
3          Yes     Sales Channel       Branch
4           No     Sales Channel       Branch
...        ...               ...          ...
10905       No     Sales Channel          Web
10906       No     Sales Channel       Branch
10907       No     Sales Channel          Web
10908       No     Sales Channel       Branch
10909      NaN     Sales Channel          Web

[10910 rows x 3 columns]

In [71]:
# Filtrar por respuestas afirmativas
df_response_yes = df_melted[df_melted['Response'] == 'Yes']

In [72]:
df_response_yes

      Response Marketing Channel Channel Used
3          Yes     Sales Channel       Branch
8          Yes     Sales Channel       Branch
15         Yes     Sales Channel       Branch
19         Yes     Sales Channel  Call Center
27         Yes     Sales Channel        Agent
...        ...               ...          ...
10844      Yes     Sales Channel        Agent
10852      Yes     Sales Channel  Call Center
10872      Yes     Sales Channel        Agent
10887      Yes     Sales Channel        Agent
10897      Yes     Sales Channel        Agent

[1466 rows x 3 columns]

In [75]:
response_count = df_response_yes['Channel Used'].value_counts()
total_count = df_melted['Channel Used'].value_counts()

In [77]:
# Calcular la tasa de respuesta
response_rate = response_count / total_count

# Convertir a DataFrame
df_response_rate = response_rate.reset_index(name='Response Rate')
df_response_rate.columns = ['Sales Channel', 'Response Rate']

df_response_rate

  Sales Channel  Response Rate
0         Agent       0.180053
1        Branch       0.107876
2   Call Center       0.103223
3           Web       0.108856